var tree = [
    {
        "p_id": 0,
        "id": 1,
        "name": "北京市"
    },
    {
        "p_id": 200,
        "id": 204,
        "name": "南开区"
    },
    {
        "p_id": 200,
        "id": 206,
        "name": "红桥区"
    },
    {
        "p_id": 2,
        "id": 200,
        "name": "市辖区",
    },
    {
        "p_id": 0,
        "id": 2,
        "name": "天津市",
    },
    {
        "p_id": 6,
        "id": 645,
        "name": "抚顺市"
    },
    {
        "p_id": 0,
        "id": 6,
        "name": "辽宁省",
    },
    {
        "p_id": 3477,
        "id": 3479,
        "name": "中西区"
    },
    {
        "p_id": 0,
        "id": 33,
        "name": "港澳",
    },
    {
        "p_id": 33,
        "id": 3477,
        "name": "香港特别行政区",
    },
    {
        "p_id": 33,
        "id": 3478,
        "name": "澳门特别行政区",
    },
    {
        "p_id": 3478,
        "id": 3502,
        "name": "路凼城"
    },
    {
        "p_id": 1675,
        "id": 1716,
        "name": "涧西区"
    },
    {
        "p_id": 1675,
        "id": 1714,
        "name": "西工区"
    },
    {
        "p_id": 0,
        "id": 16,
        "name": "河南省",
    },
    {
        "p_id": 16,
        "id": 1675,
        "name": "洛阳市",
    },
    {
        "p_id": 16,
        "id": 1677,
        "name": "开封市",
    },
    {
        "p_id": 1677,
        "id": 1800,
        "name": "开封1"
    },
    {
        "p_id": 1677,
        "id": 1801,
        "name": "开封2"
    }
]